{
    "profile":[
        {
        "title": "Developer",
        "WID": "Currently enrolled as a Full Stack Development student at Lambda School I spend hours a day learning new technologies to add to my development stack.",
        "Heart": "I love coding because anything I conceptualize I can build. Sure, I might struggle or need to learn something new to achieve the desired result, but this challenge is worth the payoff everytime.",
        "tools": ["HTML5", "CSS3", "CSS Preprocessors", "Javascript", "React", "Redux",  "Node", "Express", "Git", "Netlify", "Heroku"]
        },
        {
        "title": "Content Creator",
        "WID": "Currently I blog and tweet about my journey as aspiring web developer. Prior, as a member of the National Basketball Production Team, I curated social posts and edited video content.",
        "Heart":"Telling stories is a core human value. In today's world of constant content and stimulation, being able to convey a story  creatively and clearly is an incredibly difficult challenge that I enjoy grappling with.", 
        "tools": ["Adobe Creative Suite", "Final Cut X", "Writing", "Editing"]
        },
        {
        "title": "Person",
        "WID": "When I'm not coding you can find me trying to teach myself the banjo, watching whatever NY Sports team is in season or cooking a fun meal with friends.",
        "tools": ["Learning the Bango", "Rooting for the Jets, Mets, & Knicks Fan", "Experimenting with new recipes", "Keeping in shape"]
        }
    ],
    "projects": [
        {
            "title": "Guidr",
            "img": "",
            "url": "https://guidr2.netlify.com/",
            "githubURL": "https://github.com/guidr-app-lion-team/guidr-client-deploy",
            "description": "During Lambda's inaugural Build Week I served as Lead Frontend Developer for my team. Our objective was to build a functional app for back-country guides to catalog their trips and connect with other guides. Over four 12+ hour days we constructed this fun application.",
            "takeaways": "Working on a team of complete strangers is never easy. Include a tight deadline and it becomes even more difficult. Luckily, my team and I were great at communicating. This provided an immense amount of clarity allowing us to know our progress and delegate work appropriately.",
            "tools": [ "React", "Redux", "Axios", "TailwindCSS", "CSS", "Javascript", "Git", "Netlify", "Team Work"],
            "screenshots": [],
            "thumbnail": "../imgs/logo-final.png"
        },
        {
            "title": "Pokedex Redux",
            "img": "",
            "url": "https://basile-pokedex.netlify.com/",
            "githubURL": "https://github.com/mattbasile/Pokedex-Deploy",
            "description": "When we first began learning about APIs I was introduced to the Pokemon API. The following weekend, I wanted to reinforce my new React, Redux and Axios knowledge, so I decided to create a Pokedex to do so. Childhood me would be very proud.",
            "takeaways": "Building this project was a fantastic introduction to the world of APIs. Specifically, how to massage data we receive and using that massaged data to them make alternate requests. It also allowed me to work on my loading screen animations.",
            "tools": [ "React", "Redux", "Axios", "TailwindCSS", "CSS", "Javascript", "Git", "Netlify"],
            "screenshots": [],
            "thumbnail": "../imgs/logo-final.png"
        },
        {
            "title": "DBZ Battles",
            "img": "",
            "url": "https://mattbasile.github.io/",
            "githubURL": "https://github.com/mattbasile/DragonballZ-Battle",
            "description": "One of our first projects at Lambda was to build a Javascript battle game in our console. I took this concept and proceeded to build out a DBZ themed game that moved from the console to the DOM.",
            "takeaways": "At this time constructors and classes were relatively new to me in JS. Getting to reinforce them in an engaging project like this was incredibly fun. Also, the amount of DOM manipulation involved was super interesting and if I ever need to make a vanilla JS app again I'm confident I can.",
            "WIL": "what I learned over that time",
            "tools": [ "HTML5", "CSS", "CSS Animations", "LESS", "Javascript", "Git", "Github Pages"],
            "screenshots": [],
            "thumbnail": "../imgs/logo-final.png"
        }

    ]

}